SM_для_EDT/src/Catalogs/vftНесоответствия/vftНесоответствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftНесоответствия</name>
  <owners>Catalog.vftДокладыОНесоответствии</owners>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректирующиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийНесоответствие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРешениеКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписаниеНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКорректирующийхДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйРешение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйРешение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПринятыеДляУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйКомментарийДонесение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДонесенияОбУстранении</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДонесения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуютсяПредупреждающиеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПоПредотвращениюПовторенияНесоответствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредписанныеСрокиПредупреждающихДействий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемыеСрокиВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственныйПредупреждающиеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственныйПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗамечания</name>
    <type>
      <types>EnumRef.рарусТипыЗамечания</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПредупреждающиеДействия</name>
    <type>
      <types>CatalogRef.рарусЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстраненияЗамечания</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовУстраненияЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗамечаний</name>
    <type>
      <types>CatalogRef.рарусКлассификаторыКодовЗамечаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторяющеесяЗамечания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПКД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждающиеДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗамечаниеЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаЗакрытиеЗамечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЗамечания</name>
    <type>
      <types>CatalogRef.vftДокладыОНесоответствии</types>
      <types>DocumentRef.рарусМероприятиеСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросАнкетирования</name>
    <comment>rarus zalikh</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеССайтаOCIMF</name>
    <comment>zalikh</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОВыполненииПКДОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиоОтветственногоЗаОтметкуОВыполнении</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеПодразделенияЗаПредупреждающиеДействия</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныОтветственности</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗанаОтветственности</name>
      <type>
        <types>CatalogRef.рарусЗоныОтветственности</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректирующиеДействия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыеСрокиУстранения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьОтветственного</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИООтветственного</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПоЗамечанию</name>
    <attributes>
      <name>ДокументОтражающийДефект</name>
      <type>
        <types>DocumentRef.впЗаявкаНаСнабжение</types>
        <types>DocumentRef.впВыявленныеДефекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Documents/рарусМероприятиеСУБ/рарусМероприятиеСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рарусМероприятиеСУБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоИнспектора</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.рарусРезультатыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролирующийОрган</name>
    <type>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.рарусВидыМероприятийСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиПланГрафика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анкета</name>
    <type>
      <types>DocumentRef.Анкета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнспекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыСудов</name>
    <type>
      <types>CatalogRef.рарусСвидетельстваСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтчетаOCIMF</name>
    <comment>zalikh, для связи с отчетом аудитора с сайта OCIMF</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <comment>zalikh</comment>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.рарусТребования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/рарусСправочникСсылок/рарусСправочникСсылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСправочникСсылок</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>FSC</name>
      <description>FSC</description>
    </items>
    <items>
      <name>PSC</name>
      <description>PSC</description>
    </items>
    <items>
      <name>ГПК</name>
      <description>ГПК</description>
    </items>
    <items>
      <name>ДиректоруПоЭксплуатации</name>
      <description>Директор по эксплуатации в родительном падеже</description>
    </items>
    <items>
      <name>ИнтервалМеждуРейсами</name>
      <description>Интервал между рейсами, часы</description>
    </items>
    <items>
      <name>МаслоГД</name>
      <description>Масло ГД</description>
    </items>
    <items>
      <name>МаслоДГ</name>
      <description>Масло ДГ</description>
    </items>
    <items>
      <name>МинКоличествоСтрокАзов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Азов&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокКЕК</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение КЕК&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокЛоцман</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение участков с лоцманом&quot;</description>
    </items>
    <items>
      <name>МинКоличествоСтрокРостов</name>
      <description>Мин. кол-во строк в табл. части &quot;Прохождение Ростов&quot;</description>
    </items>
    <items>
      <name>МодельРДО_ННФ</name>
      <description>Модель РДО (Нефтеналивной флот)</description>
    </items>
    <items>
      <name>МодельРДО_СГФ</name>
      <description>Модель РДО (Сухогрузный флот)</description>
    </items>
    <items>
      <name>МодельРДО_СЗП</name>
      <description>Модель РДО (Морской сухогрузный флот)</description>
    </items>
    <items>
      <name>РМРС</name>
      <description>РМРС</description>
    </items>
    <items>
      <name>ТопливоМТ01</name>
      <description>МТ 0.1</description>
    </items>
    <items>
      <name>ТопливоМТ05</name>
      <description>МТ 0.5</description>
    </items>
    <items>
      <name>ТопливоМТ15</name>
      <description>МТ 1.5</description>
    </items>
    <items>
      <name>ТопливоСМТ</name>
      <description>СМТ</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.vftТиповыеОперации</types>
      <types>CatalogRef.Номенклатура</types>
      <types>String</types>
      <types>CatalogRef.vftПунктыСледования</types>
      <types>Number</types>
      <types>CatalogRef.рарусУчасткиСОЛП</types>
      <types>CatalogRef.впМодельРДО</types>
      <types>CatalogRef.рарусКонтролирующиеОрганы</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftНесоответствия/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = "Замечания "+ Данные.Код;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#Область Печать

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		//rarus_AfoD 27.08.2021 < 
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("Ключ") И ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.vftНесоответствия") Тогда
			
			ПараметрыОпции = Новый Структура;
			ПараметрыОпции.Вставить("Судно", Параметры.Ключ.Судно);
			ПараметрыОпции.Вставить("Период", Параметры.Ключ.Дата);
			ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ", ПараметрыОпции);
			
		Иначе
			
			ИспользоватьФункционалСУБ = ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ");
		
		КонецЕсли; 
		//rarus_AfoD 27.08.2021 > 
		
		Если ИспользоватьФункционалСУБ Тогда 
					
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Справочник.vftНесоответствия.Форма.ФормаЭлементаСУБ";		
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Судно");
	Результат.Добавить("ОписаниеНесоответствия");
	Результат.Добавить("ПричинаНесоответствия");
	Результат.Добавить("КорректирующиеДействия");
	Результат.Добавить("КодНесоответствия");
	Результат.Добавить("СсылкаНаДокумент");
	Результат.Добавить("ДополнительныйКомментарийНесоответствие");
	Результат.Добавить("ТребуетсяРешениеКомпании");
	Результат.Добавить("КраткоеОписаниеНесоответствия");
	Результат.Добавить("СодержаниеКорректирующийхДействий");
	Результат.Добавить("ПредписанныеСрокиУстранения");
	Результат.Добавить("ПланируемыеСрокиУстранения");
	Результат.Добавить("ДолжностьОтветственныйРешение");
	Результат.Добавить("ФИООтветственныйРешение");
	//Результат.Добавить("ДействияПринятыеДляУстранения");
	//Результат.Добавить("ДатаУстранения");
	//Результат.Добавить("ДополнительныйКомментарийДонесение");
	Результат.Добавить("Дата");
	Результат.Добавить("ДатаДонесенияОбУстранении");
	Результат.Добавить("НомерДонесения");	
	Результат.Добавить("ТребуютсяПредупреждающиеДействия");	
	Результат.Добавить("МерыПоПредотвращениюПовторенияНесоответствия");
	Результат.Добавить("ПредписанныеСрокиПредупреждающихДействий");
	Результат.Добавить("ПланируемыеСрокиВыполнения");
	Результат.Добавить("ДолжностьОтветственныйПредупреждающиеДействия");
	Результат.Добавить("ТипЗамечания");
	Результат.Добавить("ОтветственныеПодразделения");
	Результат.Добавить("ОтветственныеПодразделенияЗаПредупреждающиеДействия");	
	//Результат.Добавить("РешениеКомпанииПереключатель");
	Результат.Добавить("ТребуютсяПредупреждающиеДействия");	
	Результат.Добавить("КодЗамечаний");
	Результат.Добавить("КодУстраненияЗамечания");
	Результат.Добавить("ВладелецЗамечания");
	Результат.Добавить("ПредупреждающиеДействия");
	Результат.Добавить("ДокументыПоЗамечанию; ДокументыПоЗамечаниюДобавить");
	
	Возврат Результат;
	
КонецФункции

#Область РегистрацияОбмена

Процедура ПередОбработкой(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО) Экспорт
	
	рарусОбменСУБСервер.ПередОбработкой(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, ПРО);
	
КонецПроцедуры	

Процедура ПослеОбработки(ИмяПланаОбмена, Отказ, Объект, Объектметаданных, Выгрузка, Получатели) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПроверитьВхождениеКонтролирующегоОрганаВГруппуРМРС(Объект) Экспорт
		
	Если ТипЗнч(Объект.ВладелецЗамечания) <> Тип("ДокументСсылка.рарусМероприятиеСУБ") Тогда 
		Возврат Ложь;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рарусСправочникСсылок.Значение КАК Значение
	|ПОМЕСТИТЬ втОтбор
	|ИЗ
	|	Справочник.рарусСправочникСсылок КАК рарусСправочникСсылок
	|ГДЕ
	|	рарусСправочникСсылок.Ссылка = ЗНАЧЕНИЕ(Справочник.рарусСправочникСсылок.РМРС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	Документ.рарусМероприятиеСУБ КАК рарусМероприятиеСУБ
	|ГДЕ
	|	рарусМероприятиеСУБ.Ссылка = &Ссылка
	|	И рарусМероприятиеСУБ.КонтролирующийОрган В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				втОтбор.Значение КАК Значение
	|			ИЗ
	|				втОтбор КАК втОтбор)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ВладелецЗамечания);
	
	Результат =  Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеРеквзитовПоверкиПоВидуМероприятийСУБ(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.рарусМероприятиеСУБ") тогда
		Возврат Ложь;			
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рарусВидыМероприятийСУБ.ИспользуютсяКодыЗамечанийИСроковУстранения КАК ИспользуютсяКоды
	|ИЗ
	|	Документ.рарусМероприятиеСУБ КАК рарусМероприятиеСУБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.рарусВидыМероприятийСУБ КАК рарусВидыМероприятийСУБ
	|		ПО рарусМероприятиеСУБ.ВидМероприятия = рарусВидыМероприятийСУБ.Ссылка
	|ГДЕ
	|	рарусМероприятиеСУБ.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ИспользуютсяКоды = Ложь;
	Иначе	
		Выборка = Результат.Выбрать();
		Выборка.Следующий();		
		ИспользуютсяКоды = Выборка.ИспользуютсяКоды;	
	КонецЕсли;	
	
	Возврат ИспользуютсяКоды;	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
